; Test for fixing assertion failure when inserting PHI nodes after debug records
; RUN: if [ %llvmver -ge 16 ]; then %opt < %s %newLoadEnzyme -passes="enzyme" -enzyme-strict-aliasing=1 -S | FileCheck %s; fi

; ModuleID = 'safe.ll.txt'
source_filename = "std.c2be051742d3c8de-cgu.00"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@0 = external hidden unnamed_addr constant <{ ptr, [16 x i8] }>, align 8
@1 = external hidden unnamed_addr constant <{ ptr, [16 x i8] }>, align 8
@enzyme_const = external global ptr
@enzyme_dup = external global ptr
@2 = external hidden unnamed_addr constant [186 x i8], align 1
@3 = external hidden unnamed_addr constant <{ [8 x i8], [8 x i8] }>, align 8
@anon.d221b5a1ca7d011dae3ce51fb2611f53.15 = external hidden unnamed_addr constant <{ ptr, [8 x i8] }>, align 8
@anon.d221b5a1ca7d011dae3ce51fb2611f53.17 = external hidden unnamed_addr constant <{ ptr, [16 x i8] }>, align 8
@anon.677bc98fa4f847c2113641a77bae611c.3 = external hidden unnamed_addr constant <{ ptr, [16 x i8] }>, align 8
@anon.e8ad111fcdba8f51c5e77cb80a764505.26 = external hidden unnamed_addr constant <{ ptr, [8 x i8], ptr, [8 x i8] }>, align 8
@anon.080693e073b7ed74ca255f40e933ae70.59 = external hidden unnamed_addr constant <{ ptr, [8 x i8], ptr, [8 x i8] }>, align 8
@anon.080693e073b7ed74ca255f40e933ae70.61 = external hidden unnamed_addr constant <{ ptr, [8 x i8], ptr, [8 x i8] }>, align 8

!0 = !{i32 8, !"PIC Level", i32 2}
!1 = !{i32 2, !"RtLibUseGOT", i32 1}
!2 = !{i32 7, !"Dwarf Version", i32 4}
!3 = !{i32 2, !"Debug Info Version", i32 3}
!4 = !{!"rustc version 1.92.0-nightly (af7587183 2025-10-05)"}
!5 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !6, producer: "clang LLVM (rustc version 1.92.0-nightly (af7587183 2025-10-05))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!6 = !DIFile(filename: "src/lib.rs/@/4810t8lr4rp55i6jcy0q6mzvw", directory: "/home/manuel/prog/Enzyme/enzyme/benchmarks/ReverseMode/gmm")
!7 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !8, producer: "clang LLVM (rustc version 1.92.0-nightly (af7587183 2025-10-05))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!8 = !DIFile(filename: "src/lib.rs/@/93ij7lcuq962vkzw7o7acawys", directory: "/home/manuel/prog/Enzyme/enzyme/benchmarks/ReverseMode/gmm")
!9 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !10, producer: "clang LLVM (rustc version 1.92.0-nightly (af7587183 2025-10-05))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!10 = !DIFile(filename: "src/lib.rs/@/akxoswfu8ge4rrwcz84cff1xb", directory: "/home/manuel/prog/Enzyme/enzyme/benchmarks/ReverseMode/gmm")
!11 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !12, producer: "clang LLVM (rustc version 1.92.0-nightly (af7587183 2025-10-05))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!12 = !DIFile(filename: "src/lib.rs/@/d997a5lvk99kg9l3nywk6xp1m", directory: "/home/manuel/prog/Enzyme/enzyme/benchmarks/ReverseMode/gmm")
!13 = distinct !DISubprogram(name: "next<usize>", linkageName: "_ZN4core4iter5range101_$LT$impl$u20$core..iter..traits..iterator..Iterator$u20$for$u20$core..ops..range..Range$LT$A$GT$$GT$4next17h566d9e10f4c48efbE", scope: !15, file: !14, line: 849, type: !19, scopeLine: 849, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !5, templateParams: !50, retainedNodes: !48)
!14 = !DIFile(filename: "/home/manuel/prog/rust2/library/core/src/iter/range.rs", directory: "", checksumkind: CSK_MD5, checksum: "bd5e2cda5ef8f5ce87ca9ba8425e7413")
!15 = !DINamespace(name: "{impl#6}", scope: !16)
!16 = !DINamespace(name: "range", scope: !17)
!17 = !DINamespace(name: "iter", scope: !18)
!18 = !DINamespace(name: "core", scope: null)
!19 = !DISubroutineType(types: !20)
!20 = !{!21, !39}
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !23, file: !22, size: 128, align: 64, flags: DIFlagPublic, elements: !24, templateParams: !29, identifier: "9c67f04a5cd6b79a2807e8012810e193")
!22 = !DIFile(filename: "<unknown>", directory: "")
!23 = !DINamespace(name: "option", scope: !18)
!24 = !{!25}
!25 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !21, file: !22, size: 128, align: 64, elements: !26, templateParams: !29, identifier: "e69f74061023f332c1ecace61157a401", discriminator: !37)
!26 = !{!27, !33}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !25, file: !22, baseType: !28, size: 128, align: 64, extraData: i64 0)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !21, file: !22, size: 128, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !30, identifier: "67d8c48743f2f1bfc0ab004e79f8ced6")
!29 = !{}
!30 = !{!31}
!31 = !DITemplateTypeParameter(name: "T", type: !32)
!32 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !25, file: !22, baseType: !34, size: 128, align: 64, extraData: i64 1)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !21, file: !22, size: 128, align: 64, flags: DIFlagPublic, elements: !35, templateParams: !30, identifier: "bb2a329052f6b4d5bd63e8b99b80c58")
!35 = !{!36}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !34, file: !22, baseType: !32, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, scope: !21, file: !22, baseType: !38, size: 64, align: 64, flags: DIFlagArtificial)
!38 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::ops::range::Range<usize>", baseType: !40, size: 64, align: 64, dwarfAddressSpace: 0)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !41, file: !22, size: 128, align: 64, flags: DIFlagPublic, elements: !43, templateParams: !46, identifier: "c46b108006d628f8b319841afeb1307")
!41 = !DINamespace(name: "range", scope: !42)
!42 = !DINamespace(name: "ops", scope: !18)
!43 = !{!44, !45}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !40, file: !22, baseType: !32, size: 64, align: 64, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !40, file: !22, baseType: !32, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!46 = !{!47}
!47 = !DITemplateTypeParameter(name: "Idx", type: !32)
!48 = !{!49}
!49 = !DILocalVariable(name: "self", arg: 1, scope: !13, file: !14, line: 849, type: !39)
!50 = !{!51}
!51 = !DITemplateTypeParameter(name: "A", type: !32)
!52 = !DILocation(line: 849, column: 13, scope: !13)
!53 = !DILocation(line: 850, column: 14, scope: !13)
!54 = !DILocation(line: 851, column: 6, scope: !13)
!55 = distinct !DISubprogram(name: "spec_next<usize>", linkageName: "_ZN89_$LT$core..ops..range..Range$LT$T$GT$$u20$as$u20$core..iter..range..RangeIteratorImpl$GT$9spec_next17h4dfe42ce4e69327cE", scope: !56, file: !14, line: 764, type: !19, scopeLine: 764, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !5, templateParams: !30, retainedNodes: !57)
!56 = !DINamespace(name: "{impl#5}", scope: !16)
!57 = !{!58, !59}
!58 = !DILocalVariable(name: "self", arg: 1, scope: !55, file: !14, line: 764, type: !39)
!59 = !DILocalVariable(name: "old", scope: !60, file: !14, line: 766, type: !32, align: 64)
!60 = distinct !DILexicalBlock(scope: !55, file: !14, line: 766, column: 13)
!61 = !DILocation(line: 764, column: 18, scope: !55)
!62 = !DILocation(line: 765, column: 25, scope: !55)
!63 = !DILocalVariable(name: "self", arg: 1, scope: !64, file: !65, line: 1903, type: !72)
!64 = distinct !DISubprogram(name: "lt", linkageName: "_ZN4core3cmp5impls57_$LT$impl$u20$core..cmp..PartialOrd$u20$for$u20$usize$GT$2lt17h62a90545b12adf42E", scope: !66, file: !65, line: 1903, type: !69, scopeLine: 1903, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !5, templateParams: !29, retainedNodes: !73)
!65 = !DIFile(filename: "/home/manuel/prog/rust2/library/core/src/cmp.rs", directory: "", checksumkind: CSK_MD5, checksum: "2ebed4d982e1934df4c432f70a016f34")
!66 = !DINamespace(name: "{impl#58}", scope: !67)
!67 = !DINamespace(name: "impls", scope: !68)
!68 = !DINamespace(name: "cmp", scope: !18)
!69 = !DISubroutineType(types: !70)
!70 = !{!71, !72, !72}
!71 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!73 = !{!63, !74}
!74 = !DILocalVariable(name: "other", arg: 2, scope: !64, file: !65, line: 1903, type: !72)
!75 = !DILocation(line: 1903, column: 19, scope: !64, inlinedAt: !76)
!76 = distinct !DILocation(line: 765, column: 12, scope: !55)
!77 = !DILocation(line: 1903, column: 26, scope: !64, inlinedAt: !76)
!78 = !DILocation(line: 1903, column: 50, scope: !64, inlinedAt: !76)
!79 = !DILocation(line: 1903, column: 59, scope: !64, inlinedAt: !76)
!80 = !DILocation(line: 765, column: 12, scope: !55)
!81 = !DILocation(line: 771, column: 13, scope: !55)
!82 = !DILocation(line: 765, column: 9, scope: !55)
!83 = !DILocation(line: 766, column: 23, scope: !55)
!84 = !DILocation(line: 766, column: 17, scope: !60)
!85 = !DILocation(line: 768, column: 35, scope: !60)
!86 = !DILocation(line: 768, column: 13, scope: !60)
!87 = !DILocation(line: 769, column: 13, scope: !60)
!88 = !DILocation(line: 773, column: 6, scope: !55)
!89 = distinct !DISubprogram(name: "into_iter<core::ops::range::Range<usize>>", linkageName: "_ZN63_$LT$I$u20$as$u20$core..iter..traits..collect..IntoIterator$GT$9into_iter17h35b862536a052749E", scope: !91, file: !90, line: 319, type: !94, scopeLine: 319, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !5, templateParams: !98, retainedNodes: !96)
!90 = !DIFile(filename: "/home/manuel/prog/rust2/library/core/src/iter/traits/collect.rs", directory: "", checksumkind: CSK_MD5, checksum: "65a297fadeea84104fff966a2f9a30dc")
!91 = !DINamespace(name: "{impl#0}", scope: !92)
!92 = !DINamespace(name: "collect", scope: !93)
!93 = !DINamespace(name: "traits", scope: !17)
!94 = !DISubroutineType(types: !95)
!95 = !{!40, !40}
!96 = !{!97}
!97 = !DILocalVariable(name: "self", arg: 1, scope: !89, file: !90, line: 319, type: !40)
!98 = !{!99}
!99 = !DITemplateTypeParameter(name: "I", type: !40)
!100 = !DILocation(line: 319, column: 18, scope: !89)
!101 = !DILocation(line: 321, column: 6, scope: !89)
!102 = distinct !DISubprogram(name: "dgmm_objective", linkageName: "_ZN5gmmrs4safe14dgmm_objective17hd5def2d68203fb76E", scope: !104, file: !103, line: 15, type: !106, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, templateParams: !29, retainedNodes: !114)
!103 = !DIFile(filename: "src/safe.rs", directory: "/home/manuel/prog/Enzyme/enzyme/benchmarks/ReverseMode/gmm", checksumkind: CSK_MD5, checksum: "cd35c3119ba218b21d956af10db5ce2e")
!104 = !DINamespace(name: "safe", scope: !105)
!105 = !DINamespace(name: "gmmrs", scope: null)
!106 = !DISubroutineType(types: !107)
!107 = !{null, !108, !108}
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [f64]", file: !22, size: 128, align: 64, elements: !109, templateParams: !29, identifier: "20ddfcfce50bf865828153ff1ef46b96")
!109 = !{!110, !113}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !108, file: !22, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64, dwarfAddressSpace: 0)
!112 = !DIBasicType(name: "f64", size: 64, encoding: DW_ATE_float)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !108, file: !22, baseType: !32, size: 64, align: 64, offset: 64)
!114 = !{!115, !116}
!115 = !DILocalVariable(name: "main_term", arg: 1, scope: !102, file: !103, line: 20, type: !108)
!116 = !DILocalVariable(name: "dmain_term_0", arg: 2, scope: !102, file: !103, line: 20, type: !108)
!117 = !DILocation(line: 20, column: 5, scope: !102)
!118 = !DILocation(line: 15, column: 1, scope: !102)
!119 = !DILocation(line: 18, column: 3, scope: !102)
!120 = distinct !DISubprogram(name: "gmm_objective", linkageName: "_ZN5gmmrs4safe13gmm_objective17h849a4e1a48dbbe36E", scope: !104, file: !103, line: 19, type: !121, scopeLine: 19, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, templateParams: !29, retainedNodes: !123)
!121 = !DISubroutineType(types: !122)
!122 = !{null, !108}
!123 = !{!124, !125, !127, !129}
!124 = !DILocalVariable(name: "main_term", arg: 1, scope: !120, file: !103, line: 20, type: !108)
!125 = !DILocalVariable(name: "slse", scope: !126, file: !103, line: 22, type: !112, align: 64)
!126 = distinct !DILexicalBlock(scope: !120, file: !103, line: 22, column: 5)
!127 = !DILocalVariable(name: "iter", scope: !128, file: !103, line: 23, type: !40, align: 64)
!128 = distinct !DILexicalBlock(scope: !126, file: !103, line: 23, column: 5)
!129 = !DILocalVariable(name: "ik", scope: !130, file: !103, line: 23, type: !32, align: 64)
!130 = distinct !DILexicalBlock(scope: !128, file: !103, line: 23, column: 26)
!131 = !DILocation(line: 20, column: 5, scope: !120)
!132 = !DILocation(line: 22, column: 9, scope: !126)
!133 = !DILocation(line: 23, column: 15, scope: !128)
!134 = !DILocation(line: 22, column: 20, scope: !120)
!135 = !DILocation(line: 23, column: 15, scope: !126)
!136 = !DILocation(line: 23, column: 5, scope: !128)
!137 = !DILocation(line: 23, column: 9, scope: !128)
!138 = !DILocation(line: 23, column: 9, scope: !130)
!139 = !DILocation(line: 24, column: 25, scope: !130)
!140 = !DILocation(line: 26, column: 12, scope: !126)
!141 = !DILocation(line: 26, column: 5, scope: !126)
!142 = !DILocation(line: 27, column: 2, scope: !120)
!143 = !DILocation(line: 24, column: 9, scope: !130)
!144 = distinct !DISubprogram(name: "precondition_check", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$13unchecked_add18precondition_check17h5021e0cd12831d11E", scope: !146, file: !145, line: 68, type: !149, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, templateParams: !29, retainedNodes: !182)
!145 = !DIFile(filename: "/home/manuel/prog/rust2/library/core/src/ub_checks.rs", directory: "", checksumkind: CSK_MD5, checksum: "41b3943b2b7dc8c218ee37ead81b317d")
!146 = !DINamespace(name: "unchecked_add", scope: !147)
!147 = !DINamespace(name: "{impl#11}", scope: !148)
!148 = !DINamespace(name: "num", scope: !18)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !32, !32, !151}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !152, size: 64, align: 64, dwarfAddressSpace: 0)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !153, file: !22, size: 192, align: 64, flags: DIFlagPublic, elements: !155, templateParams: !29, identifier: "df5f75f9d369fff02c3726ce692452e1")
!153 = !DINamespace(name: "location", scope: !154)
!154 = !DINamespace(name: "panic", scope: !18)
!155 = !{!156, !170, !172, !173}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !152, file: !22, baseType: !157, size: 128, align: 64, flags: DIFlagPrivate)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<str>", scope: !158, file: !22, size: 128, align: 64, flags: DIFlagPublic, elements: !160, templateParams: !168, identifier: "f2cefde0fc0863a642bc959022a0fba")
!158 = !DINamespace(name: "non_null", scope: !159)
!159 = !DINamespace(name: "ptr", scope: !18)
!160 = !{!161}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !157, file: !22, baseType: !162, size: 128, align: 64, flags: DIFlagPrivate)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "*const str", file: !22, size: 128, align: 64, elements: !163, templateParams: !29, identifier: "238a44609877474087c05adf26cd41fa")
!163 = !{!164, !167}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !162, file: !22, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64, dwarfAddressSpace: 0)
!166 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !162, file: !22, baseType: !32, size: 64, align: 64, offset: 64)
!168 = !{!169}
!169 = !DITemplateTypeParameter(name: "T", type: !166)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !152, file: !22, baseType: !171, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!171 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !152, file: !22, baseType: !171, size: 32, align: 32, offset: 160, flags: DIFlagPrivate)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_filename", scope: !152, file: !22, baseType: !174, align: 8, offset: 192, flags: DIFlagPrivate)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&str>", scope: !175, file: !22, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !176, identifier: "8ab19967ffc9d0b4dfd90e4c8ba5b673")
!175 = !DINamespace(name: "marker", scope: !18)
!176 = !{!177}
!177 = !DITemplateTypeParameter(name: "T", type: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !22, size: 128, align: 64, elements: !179, templateParams: !29, identifier: "9277eecd40495f85161460476aacc992")
!179 = !{!180, !181}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !178, file: !22, baseType: !165, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !178, file: !22, baseType: !32, size: 64, align: 64, offset: 64)
!182 = !{!183, !184, !185}
!183 = !DILocalVariable(name: "lhs", arg: 1, scope: !144, file: !145, line: 68, type: !32)
!184 = !DILocalVariable(name: "rhs", arg: 2, scope: !144, file: !145, line: 68, type: !32)
!185 = !DILocalVariable(name: "msg", scope: !186, file: !145, line: 70, type: !178, align: 64)
!186 = distinct !DILexicalBlock(scope: !144, file: !145, line: 70, column: 21)
!187 = !DILocation(line: 68, column: 43, scope: !144)
!188 = !DILocalVariable(name: "self", arg: 1, scope: !189, file: !190, line: 2645, type: !32)
!189 = distinct !DISubprogram(name: "overflowing_add", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$15overflowing_add17h8fc014c6b1c2b038E", scope: !147, file: !190, line: 2645, type: !191, scopeLine: 2645, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, templateParams: !29, retainedNodes: !197)
!190 = !DIFile(filename: "/home/manuel/prog/rust2/library/core/src/num/uint_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "65b9bf3a9a50c9aa1f2509ce7b373fab")
!191 = !DISubroutineType(types: !192)
!192 = !{!193, !32, !32}
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, bool)", file: !22, size: 128, align: 64, elements: !194, templateParams: !29, identifier: "d571287e27d8be874e95a2f698798cc6")
!194 = !{!195, !196}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !193, file: !22, baseType: !32, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !193, file: !22, baseType: !71, size: 8, align: 8, offset: 64)
!197 = !{!188, !198}
!198 = !DILocalVariable(name: "rhs", arg: 2, scope: !189, file: !190, line: 2645, type: !32)
!199 = !DILocation(line: 2645, column: 38, scope: !189, inlinedAt: !200)
!200 = !DILocation(line: 712, column: 27, scope: !201)
!201 = !DILexicalBlockFile(scope: !144, file: !190, discriminator: 0)
!202 = !DILocation(line: 2645, column: 44, scope: !189, inlinedAt: !200)
!203 = !DILocation(line: 70, column: 25, scope: !186)
!204 = !DILocation(line: 2646, column: 26, scope: !189, inlinedAt: !200)
!205 = !DILocation(line: 712, column: 23, scope: !201)
!206 = !DILocation(line: 75, column: 14, scope: !144)
!207 = !DILocation(line: 73, column: 94, scope: !186)
!208 = !DILocation(line: 73, column: 93, scope: !186)
!209 = !DILocalVariable(name: "pieces", arg: 1, scope: !210, file: !211, line: 194, type: !340)
!210 = distinct !DISubprogram(name: "new_const<1>", linkageName: "_ZN4core3fmt2rt38_$LT$impl$u20$core..fmt..Arguments$GT$9new_const17h03b905de218d8016E", scope: !212, file: !211, line: 194, type: !338, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, templateParams: !29, declaration: !344, retainedNodes: !345)
!211 = !DIFile(filename: "/home/manuel/prog/rust2/library/core/src/fmt/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "03cba3c9b7eca44212bc16adf1d5b1bc")
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !213, file: !22, size: 384, align: 64, flags: DIFlagPublic, elements: !214, templateParams: !29, identifier: "7a47f06667015a1ff7fff03ffaaee97c")
!213 = !DINamespace(name: "fmt", scope: !18)
!214 = !{!215, !221, !263}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !212, file: !22, baseType: !216, size: 128, align: 64, flags: DIFlagPrivate)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !22, size: 128, align: 64, elements: !217, templateParams: !29, identifier: "4e66b00a376d6af5b8765440fb2839f")
!217 = !{!218, !220}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !216, file: !22, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64, dwarfAddressSpace: 0)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !216, file: !22, baseType: !32, size: 64, align: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !212, file: !22, baseType: !222, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !23, file: !22, size: 128, align: 64, flags: DIFlagPublic, elements: !223, templateParams: !29, identifier: "c6d3d6d504f5486b372bbeb9e0c91cbd")
!223 = !{!224}
!224 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !222, file: !22, size: 128, align: 64, elements: !225, templateParams: !29, identifier: "430e935c56cbc6e0ed750a83f51f13b9", discriminator: !262)
!225 = !{!226, !258}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !224, file: !22, baseType: !227, size: 128, align: 64, extraData: i64 0)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !222, file: !22, size: 128, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !228, identifier: "a6a4ad5e8eafb225c0abf74a67725a76")
!228 = !{!229}
!229 = !DITemplateTypeParameter(name: "T", type: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !22, size: 128, align: 64, elements: !231, templateParams: !29, identifier: "4dd27f4b868367bbc2c6e6195a6689aa")
!231 = !{!232, !257}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !230, file: !22, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64, dwarfAddressSpace: 0)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !235, file: !22, size: 384, align: 64, flags: DIFlagPublic, elements: !236, templateParams: !29, identifier: "867cdc70f72690957be906c1595d18b")
!235 = !DINamespace(name: "rt", scope: !213)
!236 = !{!237, !238, !239, !256}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !234, file: !22, baseType: !32, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !234, file: !22, baseType: !171, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !234, file: !22, baseType: !240, size: 128, align: 64, flags: DIFlagPublic)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !235, file: !22, size: 128, align: 64, flags: DIFlagPublic, elements: !241, templateParams: !29, identifier: "1b5ff4df120c65ffc67edd5cf3393fec")
!241 = !{!242}
!242 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !240, file: !22, size: 128, align: 64, elements: !243, templateParams: !29, identifier: "cd2436e128c22e79c984813bbb005cb6", discriminator: !255)
!243 = !{!244, !249, !253}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !242, file: !22, baseType: !245, size: 128, align: 64, extraData: i16 0)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !240, file: !22, size: 128, align: 64, flags: DIFlagPublic, elements: !246, templateParams: !29, identifier: "3860b4c7a8e38cf292aa4fb0a6c795f2")
!246 = !{!247}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !245, file: !22, baseType: !248, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!248 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !242, file: !22, baseType: !250, size: 128, align: 64, extraData: i16 1)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !240, file: !22, size: 128, align: 64, flags: DIFlagPublic, elements: !251, templateParams: !29, identifier: "40ae355ee4b5ca218177bca1e50700a")
!251 = !{!252}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !250, file: !22, baseType: !32, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !242, file: !22, baseType: !254, size: 128, align: 64, extraData: i16 2)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !240, file: !22, size: 128, align: 64, flags: DIFlagPublic, elements: !29, identifier: "7592be2a8984ca9d9bf91d4786f6f2c8")
!255 = !DIDerivedType(tag: DW_TAG_member, scope: !240, file: !22, baseType: !248, size: 16, align: 16, flags: DIFlagArtificial)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !234, file: !22, baseType: !240, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !230, file: !22, baseType: !32, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !224, file: !22, baseType: !259, size: 128, align: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !222, file: !22, size: 128, align: 64, flags: DIFlagPublic, elements: !260, templateParams: !228, identifier: "2c475c1db29e723791380fe51a915425")
!260 = !{!261}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !259, file: !22, baseType: !230, size: 128, align: 64, flags: DIFlagPublic)
!262 = !DIDerivedType(tag: DW_TAG_member, scope: !222, file: !22, baseType: !38, size: 64, align: 64, flags: DIFlagArtificial)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !212, file: !22, baseType: !264, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !22, size: 128, align: 64, elements: !265, templateParams: !29, identifier: "b758283bdeaee867749f2c2cb86911de")
!265 = !{!266, !337}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !264, file: !22, baseType: !267, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64, dwarfAddressSpace: 0)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !235, file: !22, size: 128, align: 64, flags: DIFlagPublic, elements: !269, templateParams: !29, identifier: "7a17c71d7ab34d1f646196627b73bb28")
!269 = !{!270}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !268, file: !22, baseType: !271, size: 128, align: 64, flags: DIFlagPrivate)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentType", scope: !235, file: !22, size: 128, align: 64, flags: DIFlagPrivate, elements: !272, templateParams: !29, identifier: "c7ef6c2b97aa1b0898e0dbb3c903ca02")
!272 = !{!273}
!273 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !271, file: !22, size: 128, align: 64, elements: !274, templateParams: !29, identifier: "a6059b0b035ce2d4c674d42e8be885b5", discriminator: !336)
!274 = !{!275, !332}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "Placeholder", scope: !273, file: !22, baseType: !276, size: 128, align: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !271, file: !22, size: 128, align: 64, flags: DIFlagPrivate, elements: !277, templateParams: !29, identifier: "3d9193e469e151d06011b18f07baee69")
!277 = !{!278, !286, !327}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !276, file: !22, baseType: !279, size: 64, align: 64, flags: DIFlagPrivate)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<()>", scope: !158, file: !22, size: 64, align: 64, flags: DIFlagPublic, elements: !280, templateParams: !284, identifier: "d724caf8b3d2575cfc2119eb7cd406ba")
!280 = !{!281}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !279, file: !22, baseType: !282, size: 64, align: 64, flags: DIFlagPrivate)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !283, size: 64, align: 64, dwarfAddressSpace: 0)
!283 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!284 = !{!285}
!285 = !DITemplateTypeParameter(name: "T", type: !283)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !276, file: !22, baseType: !287, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(core::ptr::non_null::NonNull<()>, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !288, size: 64, align: 64, dwarfAddressSpace: 0)
!288 = !DISubroutineType(types: !289)
!289 = !{!290, !279, !307}
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !291, file: !22, size: 8, align: 8, flags: DIFlagPublic, elements: !292, templateParams: !29, identifier: "acd70010668961733032a81677e3a1f6")
!291 = !DINamespace(name: "result", scope: !18)
!292 = !{!293}
!293 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !290, file: !22, size: 8, align: 8, elements: !294, templateParams: !29, identifier: "134a126fb51d6e7bfe4ac5689cdeef83", discriminator: !306)
!294 = !{!295, !302}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !293, file: !22, baseType: !296, size: 8, align: 8, extraData: i8 0)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !290, file: !22, size: 8, align: 8, flags: DIFlagPublic, elements: !297, templateParams: !299, identifier: "d99948acdf64f45322eea7a5541ef0eb")
!297 = !{!298}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !296, file: !22, baseType: !283, align: 8, offset: 8, flags: DIFlagPublic)
!299 = !{!285, !300}
!300 = !DITemplateTypeParameter(name: "E", type: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !213, file: !22, align: 8, flags: DIFlagPublic, elements: !29, identifier: "4652b324dc796ed82167a937d9695cdc")
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !293, file: !22, baseType: !303, size: 8, align: 8, extraData: i8 1)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !290, file: !22, size: 8, align: 8, flags: DIFlagPublic, elements: !304, templateParams: !299, identifier: "8c9647fdf36c92caff8b2560cc299bc7")
!304 = !{!305}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !303, file: !22, baseType: !301, align: 8, offset: 8, flags: DIFlagPublic)
!306 = !DIDerivedType(tag: DW_TAG_member, scope: !290, file: !22, baseType: !166, size: 8, align: 8, flags: DIFlagArtificial)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !308, size: 64, align: 64, dwarfAddressSpace: 0)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !213, file: !22, size: 192, align: 64, flags: DIFlagPublic, elements: !309, templateParams: !29, identifier: "97ade6d90b9d899aeeda5c8143d9b7a5")
!309 = !{!310, !316}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !308, file: !22, baseType: !311, size: 64, align: 32, offset: 128, flags: DIFlagPrivate)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FormattingOptions", scope: !213, file: !22, size: 64, align: 32, flags: DIFlagPublic, elements: !312, templateParams: !29, identifier: "8b4ddd817c2ce67f9ceec8a0f8a7ceb7")
!312 = !{!313, !314, !315}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !311, file: !22, baseType: !171, size: 32, align: 32, flags: DIFlagPrivate)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !311, file: !22, baseType: !248, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !311, file: !22, baseType: !248, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !308, file: !22, baseType: !317, size: 128, align: 64, flags: DIFlagPrivate)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !22, size: 128, align: 64, elements: !318, templateParams: !29, identifier: "5774209541d22b676b07bca66e5d4536")
!318 = !{!319, !322}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !317, file: !22, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64, dwarfAddressSpace: 0)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !22, align: 8, elements: !29, identifier: "5dfd794ece931e18d0ba3c6f661eb5f6")
!322 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !317, file: !22, baseType: !323, size: 64, align: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 6]", baseType: !324, size: 64, align: 64, dwarfAddressSpace: 0)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 384, align: 64, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 6, lowerBound: 0)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_lifetime", scope: !276, file: !22, baseType: !328, align: 8, offset: 128, flags: DIFlagPrivate)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&()>", scope: !175, file: !22, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !329, identifier: "ba892b4c18db535076ae1e656d61832d")
!329 = !{!330}
!330 = !DITemplateTypeParameter(name: "T", type: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&()", baseType: !283, size: 64, align: 64, dwarfAddressSpace: 0)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Count", scope: !273, file: !22, baseType: !333, size: 128, align: 64, extraData: i64 0)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !271, file: !22, size: 128, align: 64, flags: DIFlagPrivate, elements: !334, templateParams: !29, identifier: "33428427eb5c845177614220fcfef113")
!334 = !{!335}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !333, file: !22, baseType: !248, size: 16, align: 16, offset: 64, flags: DIFlagPrivate)
!336 = !DIDerivedType(tag: DW_TAG_member, scope: !271, file: !22, baseType: !38, size: 64, align: 64, flags: DIFlagArtificial)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !264, file: !22, baseType: !32, size: 64, align: 64, offset: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!212, !340}
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[&str; 1]", baseType: !341, size: 64, align: 64, dwarfAddressSpace: 0)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 128, align: 64, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 1, lowerBound: 0)
!344 = !DISubprogram(name: "new_const<1>", linkageName: "_ZN4core3fmt2rt38_$LT$impl$u20$core..fmt..Arguments$GT$9new_const17h03b905de218d8016E", scope: !212, file: !211, line: 194, type: !338, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !29)
!345 = !{!209}
!346 = !DILocation(line: 194, column: 44, scope: !210, inlinedAt: !347)
!347 = !DILocation(line: 73, column: 59, scope: !186)
!348 = !DILocation(line: 196, column: 9, scope: !210, inlinedAt: !347)
!349 = !DILocation(line: 73, column: 21, scope: !186)
!350 = !{!351}
!351 = distinct !{!351, !352, !"_ZN5alloc7raw_vec20RawVecInner$LT$A$GT$14grow_amortized17hb1d395eb5c3a51a4E: argument 0"}
!352 = distinct !{!352, !"_ZN5alloc7raw_vec20RawVecInner$LT$A$GT$14grow_amortized17hb1d395eb5c3a51a4E"}
!353 = !{!"branch_weights", !"expected", i32 1, i32 2000}
!354 = !{i64 0, i64 -9223372036854775808}
!355 = !{!"branch_weights", i32 2002, i32 2000}
!356 = !{!357}
!357 = distinct !{!357, !358, !"_ZN5alloc7raw_vec20RawVecInner$LT$A$GT$14current_memory17h62a2dcaa88e8c12bE: argument 0"}
!358 = distinct !{!358, !"_ZN5alloc7raw_vec20RawVecInner$LT$A$GT$14current_memory17h62a2dcaa88e8c12bE"}
!359 = !{i64 0, i64 2}
!360 = !{i64 0, i64 -9223372036854775807}
!361 = !{!"branch_weights", !"expected", i32 2000, i32 1}
!362 = !{!363}
!363 = distinct !{!363, !364, !"_ZN5alloc3vec16Vec$LT$T$C$A$GT$15append_elements17hd132e62fa7803d84E: argument 0"}
!364 = distinct !{!364, !"_ZN5alloc3vec16Vec$LT$T$C$A$GT$15append_elements17hd132e62fa7803d84E"}
!365 = !{!366, !363}
!366 = distinct !{!366, !367, !"_ZN5alloc3vec16Vec$LT$T$C$A$GT$7reserve17h2d769b7b1ee34e7eE: argument 0"}
!367 = distinct !{!367, !"_ZN5alloc3vec16Vec$LT$T$C$A$GT$7reserve17h2d769b7b1ee34e7eE"}
!368 = !{!369}
!369 = distinct !{!369, !370, !"_ZN5alloc7raw_vec20RawVecInner$LT$A$GT$13shrink_to_fit17h85ecc1cd80b574c6E: argument 0"}
!370 = distinct !{!370, !"_ZN5alloc7raw_vec20RawVecInner$LT$A$GT$13shrink_to_fit17h85ecc1cd80b574c6E"}
!371 = !{!372}
!372 = distinct !{!372, !373, !"_ZN5alloc7raw_vec20RawVecInner$LT$A$GT$16shrink_unchecked17h6d548b35ef48c425E: argument 0"}
!373 = distinct !{!373, !"_ZN5alloc7raw_vec20RawVecInner$LT$A$GT$16shrink_unchecked17h6d548b35ef48c425E"}
!374 = !{!372, !369}
!375 = !{!376}
!376 = distinct !{!376, !377, !"_ZN77_$LT$alloc..raw_vec..RawVec$LT$T$C$A$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop17hdf7f45732cc816a4E: argument 0"}
!377 = distinct !{!377, !"_ZN77_$LT$alloc..raw_vec..RawVec$LT$T$C$A$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop17hdf7f45732cc816a4E"}
!378 = !{!379}
!379 = distinct !{!379, !380, !"_ZN5alloc7raw_vec20RawVecInner$LT$A$GT$14grow_amortized17hb1d395eb5c3a51a4E: argument 0"}
!380 = distinct !{!380, !"_ZN5alloc7raw_vec20RawVecInner$LT$A$GT$14grow_amortized17hb1d395eb5c3a51a4E"}
!381 = !{!382}
!382 = distinct !{!382, !383, !"_ZN5alloc7raw_vec20RawVecInner$LT$A$GT$14current_memory17h62a2dcaa88e8c12bE: argument 0"}
!383 = distinct !{!383, !"_ZN5alloc7raw_vec20RawVecInner$LT$A$GT$14current_memory17h62a2dcaa88e8c12bE"}
!384 = !{!385}
!385 = distinct !{!385, !386, !"_ZN5alloc7raw_vec20RawVecInner$LT$A$GT$17try_reserve_exact17hbfa71e3764eae68cE: argument 0"}
!386 = distinct !{!386, !"_ZN5alloc7raw_vec20RawVecInner$LT$A$GT$17try_reserve_exact17hbfa71e3764eae68cE"}
!387 = !{!388}
!388 = distinct !{!388, !389, !"_ZN5alloc7raw_vec20RawVecInner$LT$A$GT$10grow_exact17hf83aab6f421c3530E: argument 0"}
!389 = distinct !{!389, !"_ZN5alloc7raw_vec20RawVecInner$LT$A$GT$10grow_exact17hf83aab6f421c3530E"}
!390 = !{!388, !385}
